import 'package:clan_app/models/question_model.dart';
import 'package:clan_app/modules/common_questions_screen/cubit/states.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

class CommonQuestionsCubit extends Cubit<CommonQuestionsStates> {
  CommonQuestionsCubit() : super(CommonQuestionsInitialState());
  static CommonQuestionsCubit get(context) => BlocProvider.of(context);

  List<QuestionModel> questions = [
    QuestionModel(
      title: "ماهو كلان؟",
      body:
          "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,",
    ),
    QuestionModel(
        title: "أين يتم تسليم كلان؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "منتج مفقود من طلبي ماذا علي أن أفعل؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "ماهو ساعات العمل لديك؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "لماذا تتقاضى رسوم تخزين؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "هل بمكنني الدفع عندما يتم تسليم طلبي؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title:
            "كلان لايبيع علامتي التجارية المفضلة. كيف يمكنني أن أخبرك عن ذلك؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "أرى بانتظام راكبيك يركبون كيف يمكنني ان اصبح متسابق كلان؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "هل حناك حد أدنى لقيمة الطلب",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "لماذا اضطر في بعض الاحيان الى الانتظار لفترة اطول لطلبي",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "لماذا لايمكنني تقديم طلب خلال أوقات العمل؟",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "لقد نسيت أن اضيف شيئ لطلبي هل لايزال بامكاني تغييره",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
    QuestionModel(
        title: "سياسة الإرجاع والاستردا:",
        body:
            "هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله, هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,هنا يتم كتابة نص يتم استبداله,"),
  ];

  List<String> catigoriesColumn1 = [
    "العروض الأسبوعية",
    "العودة للمدارس",
    "برد صيفك",
    "قهوة",
    "الخضار والفواكة",
    "الخبز والمخبوزات"
  ];
  List<String> catigoriesColumn2 = [
    "الأطعمة المجمدة",
    "الرز والمكرونة والحبوب",
    "مستلزمات المطبخ",
    "المعلبات",
    "البهارات والتوابل",
    "صلصات الطبخ"
  ];
  List<String> catigoriesColumn3 = [
    "الرئيسية",
    "حول",
    "الأسئلة الشائعة",
    "سياية الخصوصية",
    "حذف الحساب",
    "وظائف"
  ];
}
